# Week 9 
## In-Class Activity Workbook and Homework

## Learning Objectives 
### In this notebook you will learn about and practice:
1. Section 1: <a id='Section 1'></a>[Section 1: Reading and examining files with pandas](#Section-1)
2. Section 2: <a id='Section 2'></a>[Section 2: Selecting Data with pandas](#Section-2)
3. Section 3: <a id='Section 3'></a>[Section 3: More practice selecting data](#Section-3)
4. Section 4: <a id='Section 4'></a>[Section 4: Conditional Selection](#Section-4)

### Additional Sources
>- Check out the `pandas` cheat sheets provided by Data Camp and posted on Canvas
>>- https://www.datacamp.com/community/blog/python-pandas-cheat-sheet

# Section 1

## What is the `pandas` module?
>- pandas is a flexible data analysis library built within the C language and is one of the fastest ways of getting from zero to answer
>- `pandas` is the go to tool for most business analysts and scientists working in python and learning to proficient in `pandas` will do wonders to your productivity and look great on your resume
>- Some say `pandas` is basically Excel on steroids
    >- `pandas` can be thought of as a mix of Python and SQL so if you know SQL working with `pandas` may come easier to you but knowing SQL is not a prerequisite for working in `pandas`
    
### Some of the useful ways in which you can use the `pandas` module include:

1. Transforming tabular data into python to work with
2. Cleaning and filtering data, whether it's missing or incomplete
3. Feature engineer new columns that can be applied in your analysis
4. Calculating statistics that answer questions (mean, median, max, min, etc)
5. Finding correlations between columns
6. Visualizing data with matplotlib

## Reading and Writing Files with the Python `pandas` Module

### Read csv or Excel files
>- csv files: `pd.read_csv('fileName.csv')`
>- Excel files: `pd.read_excel('fileName.xlsx')`
>- Multiple sheets from the same Excel file: 
>>- `xlsx = pd.ExcelFile('file.xls')` # reads in the entire workbook
>>- `df1 = pd.read_excel(xlsx, 'Sheet1')`  # reads in sheet you specify
>>- `df2 = pd.read_excel(xlsx, 'Sheet2')`

### Write csv or Excel files
>- csv files: `pd.to_csv('YourDataFrame.csv')`
>- Excel files: `pd.to_excel('YourDataFrame.xlsx')`

# Section 1
## Reading Files and Initial Data Examination with `pandas`

## Creating a `stu` DataFrame
>- Complete the following steps to practice reading in a csv file
>>- Note: You should download the `students.csv` and `students100.xlsx` files from Canvas and save it in the same director/folder that you have this notebook saved in
1. Import the pandas module and alias it `pd`

### Step 1: Check your working directory and make sure you have the `students.csv` and `students100.xlxs` files there
>- Note: There are several ways to do this

In [2]:
import os
print(os.getcwd())
os.listdir()

C:\Users\Cupcake\Python

['.ipynb_checkpoints',
 'BooleanExpressions_StudentNotes.ipynb',
 'ControlFlow_If_elseIf_StudentNotes.ipynb',
 'ControlFlow_Loops_Student.ipynb',
 'Dictionaries_Type-Along_student.ipynb',
 'Functions_Student.ipynb',
 'Gibson_Daniel_Midterm.ipynb',
 'Gibson_Daniel_Quiz2.ipynb',
 'Gibson_Daniel_Quiz3.ipynb',
 'Gibson_Daniel_Quiz4Backup.ipynb',
 'Gibson_Daniel_Quiz5.ipynb',
 'Gibson_Daniel_Quiz6.ipynb',
 'Gibson_Daniel_W5D1Warmup.ipynb',
 'Gibson_Daniel_W7D1-InClass-Dict&List_Review.ipynb',
 'Gibson_Daniel_W7D1-InClass-ListReview.ipynb',
 'Lists_Student_type-along.ipynb',
 'ManipulatingStrings_Student.ipynb',
 'Midterm Review Lab Questions_Student.ipynb',
 'pandas1&2_Read_Index_Select_Activity_student.ipynb',
 'Pandas_Part1_Student.ipynb',
 'Python_Functions_Homework.ipynb',
 'Quiz#3 - Intro Flow Control - Student.ipynb',
 'Quiz3DG.ipynb',
 'Quiz4.ipynb',
 'Quiz5.ipynb',
 'students.csv',
 'students100.xlsx',
 'Untitled.ipynb',
 'W3D1_Warmup.ipynb',
 'W6D1-Warmup.ipynb',
 'WaarmupPractice1.ipynb',
 'Week2_HW_Exercises.ipynb',
 'Week2_InClassActivity_JupyterPythonBasics_Student.ipynb',
 'Week3_InClassActivity_ControlFlow_ifelifelse_Student.ipynb',
 'Week3_InClassActivity_ControlFlow_Loops_student.ipynb',
 'Week4_InClassActivity_Functions_student.ipynb',
 'Week5_InClassActivity_Lists_student.ipynb',
 'Week5_Lists_HW_student.ipynb',
 'Week6_InClassActivity_Dictionaries_student.ipynb',
 'Week7_ManipulatingStrings_studentHW.ipynb',
 'winemag-data-130k-v2.csv']

In [3]:
for root, dirs, files in os.walk("C:\\Users\\Cupcake\\Python", topdown=False):
    for name in files:
        if name.find('student') == 0:
            print(os.path.join(root, name))

C:\Users\Cupcake\Python\students.csv
C:\Users\Cupcake\Python\students100.xlsx

### Step 2: import the `pandas` module and alias it `pd`

In [4]:
import pandas as pd

### Step 3: Read the `students.csv` file into a pandas dataframe named, `stu`
>- Look at the first five records to make sure `stu` is imported correctly

#### Loading a CSV file
function: `pd.read_csv()`

[Docu read_csv](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html?highlight=read_excel#pandas.read_excel)

In [5]:
stu = pd.read_csv('students.csv')
stu.head()

   studentID firstName lastName   birthdate     Points
0          1       Amy   Willis  10/23/1991  18.032651
1          2    Donald   Pierce    4/7/1990  79.671554
2          3      Adam   Holmes   5/16/1991  10.495381
3          4   Patrick    Payne  12/29/1990  33.449285
4          5     Chris    Lynch   10/3/1990  33.654615

#### Now, set the index column of `stu` to the studentID column
>- Note: make sure to make this change in-place
>- There are several ways to do this. Below are couple of options

1. Use the `index_col` option when reading in the file
2. Look up the `set_index` method and apply it to `stu`

In [6]:
pd.read_csv('students.csv', index_col = 0)

          firstName    lastName   birthdate     Points
studentID
1               Amy      Willis  10/23/1991  18.032651
2            Donald      Pierce    4/7/1990  79.671554
3              Adam      Holmes   5/16/1991  10.495381
4           Patrick       Payne  12/29/1990  33.449285
5             Chris       Lynch   10/3/1990  33.654615
...             ...         ...         ...        ...
96          Matthew  Cunningham   11/5/1991  84.951415
97            Kelly       Lynch   3/18/1990   4.377005
98             Ryan      Little  12/23/1988  52.021577
99           Willie      Taylor   12/6/1989  13.154354
100            Lisa      Austin  11/17/1990  94.808464

[100 rows x 4 columns]

In [7]:
pd.read_csv('students.csv', index_col = False)

    studentID firstName    lastName   birthdate     Points
0           1       Amy      Willis  10/23/1991  18.032651
1           2    Donald      Pierce    4/7/1990  79.671554
2           3      Adam      Holmes   5/16/1991  10.495381
3           4   Patrick       Payne  12/29/1990  33.449285
4           5     Chris       Lynch   10/3/1990  33.654615
..        ...       ...         ...         ...        ...
95         96   Matthew  Cunningham   11/5/1991  84.951415
96         97     Kelly       Lynch   3/18/1990   4.377005
97         98      Ryan      Little  12/23/1988  52.021577
98         99    Willie      Taylor   12/6/1989  13.154354
99        100      Lisa      Austin  11/17/1990  94.808464

[100 rows x 5 columns]

In [8]:
stu = stu.set_index('studentID')

#### Look at the first five records after you have set the index

In [9]:
stu.head()

          firstName lastName   birthdate     Points
studentID
1               Amy   Willis  10/23/1991  18.032651
2            Donald   Pierce    4/7/1990  79.671554
3              Adam   Holmes   5/16/1991  10.495381
4           Patrick    Payne  12/29/1990  33.449285
5             Chris    Lynch   10/3/1990  33.654615

#### Show the last five records of `stu`

In [10]:
stu.tail()

          firstName    lastName   birthdate     Points
studentID
96          Matthew  Cunningham   11/5/1991  84.951415
97            Kelly       Lynch   3/18/1990   4.377005
98             Ryan      Little  12/23/1988  52.021577
99           Willie      Taylor   12/6/1989  13.154354
100            Lisa      Austin  11/17/1990  94.808464

#### Show a tuple of the number of columns and rows in `stu`

In [11]:
stu.shape

(100, 4)

#### Show the number rows another way

In [12]:
len(stu)

100

#### Show the columns in `stu`

In [13]:
stu.columns

Index(['firstName', 'lastName', 'birthdate', 'Points'], dtype='object')

#### Show the datatypes that are in `stu`

In [14]:
stu.dtypes

firstName     object
lastName      object
birthdate     object
Points       float64
dtype: object

# Section 2
## Accessing Data using `pandas`

#### Access all the records of the `firstName` Column Only
>- Try doing this three different ways

In [15]:
stu.loc[:,'firstName']

studentID
1          Amy
2       Donald
3         Adam
4      Patrick
5        Chris
        ...
96     Matthew
97       Kelly
98        Ryan
99      Willie
100       Lisa
Name: firstName, Length: 100, dtype: object

In [16]:
stu.iloc[0:5,0:1]

          firstName
studentID
1               Amy
2            Donald
3              Adam
4           Patrick
5             Chris

In [17]:
stu.firstName

studentID
1          Amy
2       Donald
3         Adam
4      Patrick
5        Chris
        ...
96     Matthew
97       Kelly
98        Ryan
99      Willie
100       Lisa
Name: firstName, Length: 100, dtype: object

In [18]:
stu['firstName']

studentID
1          Amy
2       Donald
3         Adam
4      Patrick
5        Chris
        ...
96     Matthew
97       Kelly
98        Ryan
99      Willie
100       Lisa
Name: firstName, Length: 100, dtype: object

In [19]:
stu.iloc[:,1]

studentID
1          Willis
2          Pierce
3          Holmes
4           Payne
5           Lynch
          ...
96     Cunningham
97          Lynch
98         Little
99         Taylor
100        Austin
Name: lastName, Length: 100, dtype: object

#### Show all the data for rows 3 to 10

In [20]:
stu.iloc[2:10]

          firstName   lastName   birthdate     Points
studentID
3              Adam     Holmes   5/16/1991  10.495381
4           Patrick      Payne  12/29/1990  33.449285
5             Chris      Lynch   10/3/1990  33.654615
6          Clarence     George   4/29/1988  79.655349
7             James     Lawson  10/17/1989   8.996545
8           Barbara  Robertson   12/5/1991  60.141281
9             Louis    Simpson  12/13/1990  58.775231
10           Dennis    Gilbert   12/7/1990  29.948968

#### Show all the data in the last row

In [21]:
stu.iloc[-1]

firstName          Lisa
lastName         Austin
birthdate    11/17/1990
Points          94.8085
Name: 100, dtype: object

In [22]:
stu.iloc[-1:]

          firstName lastName   birthdate     Points
studentID
100            Lisa   Austin  11/17/1990  94.808464

#### Show the first 3 records of the third column
>- Try doing this in three different ways

In [23]:
stu.iloc[:3,2]

studentID
1    10/23/1991
2      4/7/1990
3     5/16/1991
Name: birthdate, dtype: object

In [24]:
stu.iloc[0:3,2:3]

            birthdate
studentID
1          10/23/1991
2            4/7/1990
3           5/16/1991

In [25]:
stu.loc[:,'birthdate'][-6:-1]

studentID
95     5/17/1988
96     11/5/1991
97     3/18/1990
98    12/23/1988
99     12/6/1989
Name: birthdate, dtype: object

#### Show the last 3 records of the first and last columns
>- Try doing this in three different ways

In [26]:
stu.iloc[-3:,[0,-1]]

          firstName     Points
studentID
98             Ryan  52.021577
99           Willie  13.154354
100            Lisa  94.808464

In [27]:
stu.loc[98:101 ,['firstName','Points']]

          firstName     Points
studentID
98             Ryan  52.021577
99           Willie  13.154354
100            Lisa  94.808464

# Section 3
## More practice and notes on selecting data
>- `iloc` - index based selection
>- `loc` - label based selection

### Additional Source for DataFrame Methods

[Docu DF Methods](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html)

## `.iloc(arg1, arg2)`

accesses data by row and column  (i stands for integer)

`arg1`: row number

`arg2`: column number

first row has index 0 <br>
first column has index 0 <br>
index column is always shown (not included in column count)

### First, let's remind ourselves what the `stu` DataFrame looks like
>- Show the first five records of the `stu` DataFrame

In [28]:
stu.head()

          firstName lastName   birthdate     Points
studentID
1               Amy   Willis  10/23/1991  18.032651
2            Donald   Pierce    4/7/1990  79.671554
3              Adam   Holmes   5/16/1991  10.495381
4           Patrick    Payne  12/29/1990  33.449285
5             Chris    Lynch   10/3/1990  33.654615

### Using `iloc()`, show the first ten records of the first 2 columns of `stu`

In [29]:
stu.iloc[:10,[0,1]]

          firstName   lastName
studentID
1               Amy     Willis
2            Donald     Pierce
3              Adam     Holmes
4           Patrick      Payne
5             Chris      Lynch
6          Clarence     George
7             James     Lawson
8           Barbara  Robertson
9             Louis    Simpson
10           Dennis    Gilbert

### Using `iloc()` show rows 2-10 for the last two columns of `stu`

In [30]:
stu.iloc[1:10,[-2,-1]]

            birthdate     Points
studentID
2            4/7/1990  79.671554
3           5/16/1991  10.495381
4          12/29/1990  33.449285
5           10/3/1990  33.654615
6           4/29/1988  79.655349
7          10/17/1989   8.996545
8           12/5/1991  60.141281
9          12/13/1990  58.775231
10          12/7/1990  29.948968

### Using `iloc()` show rows 85 to the end of the DataFrame for all columns

In [46]:
stu.iloc[84:,]

          firstName    lastName   birthdate     Points
studentID
85          Deborah       Owens    5/7/1991  49.937980
86          Charles    Martinez    4/7/1988  83.866490
87          Anthony       Baker   8/14/1989  68.802021
88          Matthew        Sims   8/14/1990  78.932542
89            Robin     Collins    9/9/1991   1.619006
90              Ann      Powell   2/27/1988  54.369955
91             Earl   Robertson   1/26/1989  45.399924
92            Helen    Morrison   5/13/1988  90.407461
93            David        Dean   9/28/1989  78.979862
94            Alice         Fox   8/14/1989  27.961554
95           Donald     Nichols   5/17/1988  71.406950
96          Matthew  Cunningham   11/5/1991  84.951415
97            Kelly       Lynch   3/18/1990   4.377005
98             Ryan      Little  12/23/1988  52.021577
99           Willie      Taylor   12/6/1989  13.154354
100            Lisa      Austin  11/17/1990  94.808464

### Using `iloc()`, show columns 2 to 4 (lastName to Points) for all records

In [70]:
stu.iloc[:,[1,3]]

             lastName     Points
studentID
1              Willis  18.032651
2              Pierce  79.671554
3              Holmes  10.495381
4               Payne  33.449285
5               Lynch  33.654615
...               ...        ...
96         Cunningham  84.951415
97              Lynch   4.377005
98             Little  52.021577
99             Taylor  13.154354
100            Austin  94.808464

[100 rows x 2 columns]

### Using `iloc()`, show rows 20 to 25, columns 1 to 2 (firstname and lastname)

In [73]:
stu.iloc[19:25,[0,1]]

          firstName    lastName
studentID
20             Eric       Adams
21             Jose       White
22            Susan      Little
23           Angela         Ray
24          Raymond      Garcia
25            Emily  Richardson

### Using `iloc()`, show rows 1,5,7 and columns 1,4 (firstName and Points)

In [98]:
stu.iloc[[1,5,7],[1,4]]

  firstName     Points
1    Donald  79.671554
5  Clarence  79.655349
7   Barbara  60.141281

## `.loc`, label-based selection

>- Use index values to show specific rows
>- Use column labels to show specific columns

### Using `loc` show students with student number 75-80

In [78]:
stu.loc[75:80]

          firstName  lastName  birthdate     Points
studentID
75            Norma     Lynch  12/2/1991  46.269019
76            Jason   Freeman   6/1/1989  34.684327
77           Thomas  Lawrence  3/15/1991  90.077218
78           Daniel   Wallace  3/25/1991  82.183959
79          Charles    Austin  10/6/1990  72.173290
80          Brandon     Clark  11/8/1990  99.585281

### Using `loc` show the `birthdate` of studentIds of 10-15

In [80]:
stu.loc[10:15,['birthdate']]

           birthdate
studentID
10         12/7/1990
11         6/25/1988
12         4/29/1990
13         2/13/1990
14         2/19/1988
15         5/14/1989

### Using `loc`, show the birthdate and points for student ids between 3 and 8

In [82]:
stu.loc[3:8,['birthdate','Points']]

            birthdate     Points
studentID
3           5/16/1991  10.495381
4          12/29/1990  33.449285
5           10/3/1990  33.654615
6           4/29/1988  79.655349
7          10/17/1989   8.996545
8           12/5/1991  60.141281

### Using `loc`, show the last name and points for student ids of 1, 50, and 100

In [86]:
stu.loc[[1,50,100],['lastName','Points']]

            lastName     Points
studentID
1             Willis  18.032651
50         Gutierrez  76.242660
100           Austin  94.808464

# Section 4
## Conditional Selection with `loc`

### Using `loc` show the students with point values greater than 90

In [97]:
stu.loc[stu['Points']>90]

          firstName  lastName   birthdate     Points
studentID
17            Kevin    Kelley   12/8/1991  94.010548
33             Paul     Meyer   6/14/1988  98.565056
53           Eugene   Simpson   10/6/1990  97.350789
68           Bonnie     Davis  12/29/1990  98.024765
77           Thomas  Lawrence   3/15/1991  90.077218
80          Brandon     Clark   11/8/1990  99.585281
81            Tammy   Andrews  10/10/1989  95.620905
92            Helen  Morrison   5/13/1988  90.407461
100            Lisa    Austin  11/17/1990  94.808464

### Using `loc` show students with points between 50 and 60

In [105]:
stu.loc[(stu['Points']>50)&(stu['Points']<60)]

          firstName  lastName   birthdate     Points
studentID
9             Louis   Simpson  12/13/1990  58.775231
30            Laura      Boyd   9/11/1989  56.196735
34            Steve    Arnold   7/19/1991  50.544916
35             Lori     Ellis    2/9/1991  59.719574
52            Carol    Chavez   7/12/1989  56.221652
56          Richard  Morrison   5/25/1991  56.677096
71            Kevin  Campbell   9/28/1991  52.267152
90              Ann    Powell   2/27/1988  54.369955
98             Ryan    Little  12/23/1988  52.021577

### Show students with points either less than 10 or greater than 90

In [107]:
stu.loc[(stu['Points']>90)|(stu['Points']<10)]

          firstName  lastName   birthdate     Points
studentID
7             James    Lawson  10/17/1989   8.996545
11           Andrew  Thompson   6/25/1988   8.550434
16           Jeremy  Hamilton  10/12/1991   6.864933
17            Kevin    Kelley   12/8/1991  94.010548
24          Raymond    Garcia   12/8/1989   5.904415
29           Andrea   Perkins   3/26/1988   1.413170
33             Paul     Meyer   6/14/1988  98.565056
39             Jose    Rivera    7/5/1991   2.994308
43            Julie     Smith   8/10/1989   7.022810
45           Philip    Gibson   8/27/1988   0.691375
53           Eugene   Simpson   10/6/1990  97.350789
66             Judy     Green   2/11/1991   8.314689
68           Bonnie     Davis  12/29/1990  98.024765
77           Thomas  Lawrence   3/15/1991  90.077218
80          Brandon     Clark   11/8/1990  99.585281
81            Tammy   Andrews  10/10/1989  95.620905
89            Robin   Collins    9/9/1991   1.619006
92            Helen  Morrison   5/13/1988  90.407461
97            Kelly     Lynch   3/18/1990   4.377005
100            Lisa    Austin  11/17/1990  94.808464

### Find students with last name 'Holmes'

In [109]:
stu.loc[stu['lastName']=='Holmes']

          firstName lastName  birthdate     Points
studentID
3              Adam   Holmes  5/16/1991  10.495381

### Find students whose birth date is in 1989
>- Hint: apply `.str.endswith()` when accessing the `birthdate` column
>>- Check the data type of the birthdate field to understand why we can use a string method on a date

In [124]:
stu['birthdate'].str.lower().str.endswith('1989')

studentID
1      False
2      False
3      False
4      False
5      False
       ...
96     False
97     False
98     False
99      True
100    False
Name: birthdate, Length: 100, dtype: bool

In [125]:
stu.loc[stu['birthdate'].str.lower().str.endswith('1989')]

          firstName   lastName   birthdate     Points
studentID
7             James     Lawson  10/17/1989   8.996545
15           Donald     Brooks   5/14/1989  30.137299
20             Eric      Adams  10/17/1989  40.671247
24          Raymond     Garcia   12/8/1989   5.904415
28           Eugene     Medina   7/18/1989  25.228596
30            Laura       Boyd   9/11/1989  56.196735
37         Kimberly    Stevens   11/1/1989  34.823920
43            Julie      Smith   8/10/1989   7.022810
48          Anthony     Cooper    2/7/1989  69.204829
52            Carol     Chavez   7/12/1989  56.221652
57          Patrick    Garrett   7/18/1989  42.514658
61            Kevin       West   1/30/1989  13.891525
69            Diana  Armstrong   5/18/1989  20.902868
70            Betty      Olson    1/1/1989  73.081122
73            Annie  Hernandez  11/15/1989  60.804423
76            Jason    Freeman    6/1/1989  34.684327
81            Tammy    Andrews  10/10/1989  95.620905
87          Anthony      Baker   8/14/1989  68.802021
91             Earl  Robertson   1/26/1989  45.399924
93            David       Dean   9/28/1989  78.979862
94            Alice        Fox   8/14/1989  27.961554
99           Willie     Taylor   12/6/1989  13.154354

### Find students whose first name starts with 'A'

In [126]:
stu.loc[stu['firstName'].str.startswith('A')]

          firstName   lastName   birthdate     Points
studentID
1               Amy     Willis  10/23/1991  18.032651
3              Adam     Holmes   5/16/1991  10.495381
11           Andrew   Thompson   6/25/1988   8.550434
23           Angela        Ray   3/31/1991  36.966729
29           Andrea    Perkins   3/26/1988   1.413170
47            Aaron      Hicks   5/25/1990  19.653815
48          Anthony     Cooper    2/7/1989  69.204829
67             Adam  Armstrong   1/18/1990  27.772003
73            Annie  Hernandez  11/15/1989  60.804423
87          Anthony      Baker   8/14/1989  68.802021
90              Ann     Powell   2/27/1988  54.369955
94            Alice        Fox   8/14/1989  27.961554

### Find students whose `lastName` starts with 'C' that have 90 or more `Points`

In [127]:
stu.loc[(stu['lastName'].str.startswith('C'))&(stu['Points']>=90)]

          firstName lastName  birthdate     Points
studentID
80          Brandon    Clark  11/8/1990  99.585281

### Find students whose `lastName` starts with 'C' or 'B' with 80 or more `Points`

In [129]:
stu.loc[((stu['lastName'].str.startswith('C'))|(stu['lastName'].str.startswith('B')))&(stu['Points']>=80)]

          firstName    lastName  birthdate     Points
studentID
80          Brandon       Clark  11/8/1990  99.585281
96          Matthew  Cunningham  11/5/1991  84.951415